<template>
  <section
    class="list-of-jobs px-4 pt-14 overflow-hidden md:overflow-auto"
    id="job-list"
  >
    <h2 class="text-center text-2xl pb-3">{{ headerText }}</h2>
    <ul class="job-list pl-4 pb-4">
      <li class="jobs-item flex" v-for="item in jobsList" :key="item">
        <span class="job-text pl-1.5">
          {{ item }}
        </span>
      </li>
    </ul>
    <p class="text-center pb-4 md:hidden">
      {{ comment }}
    </p>
    <JobsIcons />
  </section>
</template>

<script lang="ts">
import Vue from "vue";

export default Vue.extend({
  data() {
    return {
      headerText: "Список услуг",
      comment: "И многое другое...",
      jobsList: Array<string>(
        "Разводка труб водоснабжения",
        "Установка сантехнических приборов",
        "Автономное отопление под ключ",
        "Регуляторы расхода воды",
        "Ремонт ванной комнаты под ключ",
        "Ремонт в кредит",
        "Замена счетчиков воды",
        "Замена труб в квартире",
        "Замена батарей отопления",
        "Замена полотенцесушителя",
        "Замена смесителя",
        "Замена стояков в квартире",
        "Замена шарового крана",
        "Пломбировка счетчиков воды",
        "Подключение посудомоечной машины",
        "Подключение стиральной машины",
        "Установка гребенки сантехнической",
        "Установка душевых кабин",
        "Установка замена водонагревателя",
        "Установка регулятора давления",
        "Устранение засоров",
        "установка унитаза",
        "установка раковины мойки",
        "установка счетчиков газа",
        "установка фильтра для воды",
        "устранение протечек труб",
        "установка биде",
        "Чистка фильтров воды",
        "Установка сололифта",
        "Замена сантехники",
        "Сантехника под ключ",
        "Установка джакуз",
        "установка сифона",
        "Замена унитаза",
        "Монтаж труб",
        "Установка полотенцесушителя",
        "Монтаж бойлера",
        "Установка радиаторов отопления",
        "Сварка труб",
        "Установка гигиенического душа",
        "Установка ванны",
        "Газовое отопление дома",
        "Установка инсталляции унитаза",
        "Установка сантехнических приборов",
        "Автономное отопление под ключ",
        "Регуляторы расхода воды",
        "Ремонт ванной комнаты под ключ",
        "Замена счетчиков воды",
        "Замена труб в квартире",
        "Замена батарей отопления",
        "Замена полотенцесушителя",
        "Замена смесителя",
        "Замена стояков в квартире",
        "Замена шарового крана",
        "Пломбировка счетчиков воды",
        "Подключение посудомоечной машины",
        "Подключение стиральной машины",
        "Ремонт сантехники",
        "Установка гребенки сантехнической",
        "Установка душевых кабин",
        "Установка замена водонагревателя",
        "Установка регулятора давления",
        "Устранение засоров",
        "установка унитаза",
        "установка раковины мойки",
        "установка фильтра для воды",
        "устранение протечек труб",
        "установка биде",
        "Чистка фильтров воды",
        "Установка сололифта",
        "Замена сантехники",
        "Сантехника под ключ",
        "Установка джакузи",
        "установка сифона",
        "Замена унитаза",
        "Замена газового счетчика",
        "Монтаж труб",
        "Установка полотенцесушителя",
        "Монтаж бойлера",
        "Установка радиаторов отопления",
        "Сварка труб",
        "Установка гигиенического душа",
        "Установка ванны",
        "Газовое отопление дома",
        "Установка инсталляции унитаза",
        "Контрольные показания счетчиков воды"
      )
    };
  }
});
</script>

<style scoped>
.job-list {
  height: 60vh;
  column-count: 1;
}
@media screen and (min-width: 768px) {
  .job-list {
    column-count: 2;
    height: auto;
  }
}
@media screen and (min-width: 1024px) {
  .job-list {
    column-count: 3;
  }
}
.jobs-item::before {
  content: "\2714";
  color: #10b981;
}
.job-text::first-letter {
  text-transform: uppercase;
}
</style>
